CSI API ETABS v1
cDCoItalianNTC2008C.SetPreference Method
 Sets the value of a concrete design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDCoItalianNTC2008C
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 3 and 34, inclusive, indicating the preference item considered.
Second order method
Number of interaction curves
Number of interaction points
Consider minimum eccentricity
Theta0
Gamma steel
Gamma concrete
AlphaCC
AlphaCT
AlphaLCC
AlphaLCT
Pattern live load factor
Utilization factor limit
Multi-response case design
Gamma concrete modulus
Gamma concrete modulus
Consider torsion
Design for B/C capacity ratio
Ignore Beneficial Pu for Beam Design?
User defined allowable PT stresses
Concrete Strength Ratio at Transfer fck(t) / fck
Transfer: Top Fiber Tensile Stress / fctm(t)
Transfer: Bottom Fiber Tensile Stress / fctm(t)
Transfer: Extreme Fiber Compressive Stress / fck(t)
Final: Top Fiber Tensile Stress / fctm
Final: Bottom Fiber Tensile Stress / fctm
Final: Extreme Fiber Compressive Stress / fck
Sustained: Extreme Fiber Compressive Stress / fck
Sustained: Fraction of Live Load Considered
Longitudinal Rebar Size Top
Longitudinal Rebar Size Bottom
Is Longitudinal Rebar Ribbed
Value
Type: System.Double
 The value of the considered preference item.
 Second order method
1 = Nominal stiffness
2 = Nominal curvature
3 = None
 Number of interaction curves
 Value >= 4 and divisable by 4
 Number of interaction points
 Value >= 5 and odd
 Consider minimum eccentricity
 0 = No
 Any other value = Yes
 Theta0
 Value > 0
 Gamma steel
 Value > 0
 Gamma concrete
 Value > 0
 AlphaCC
 Value > 0
 AlphaCT
 Value > 0
 AlphaLCC
 Value > 0
 AlphaLCT
 Value > 0
 Pattern live load factor
 Value >= 0
 Utilization factor limit
 Value > 0
 Multi-response case design
1 = Envelopes
2 = Step-by step
3 = Last step
4 = Envelopes - All
5 = Step-by step - All
 Gamma concrete modulus
 Value > 0
 Consider torsion
0 = No
Any other value = Yes
 Design for B/C capacity ratio
0 = No
Any other value = Yes
 Ignore the benefit of Pu for beam design?
0 = No
Any other value = Yes
 User defined allowable PT stresses
0 = No
Any other value = Yes
 Concrete Strength Ratio at Transfer fck(t) / fck
 Value > 0
 Transfer: Top Fiber Tensile Stress / fctm(t)
 Value > 0
 Transfer: Bottom Fiber Tensile Stress / fctm(t)
 Value > 0
 Transfer: Extreme Fiber Compressive Stress / fck(t)
 Value > 0
 Final: Top Fiber Tensile Stress / fctm
 Value > 0
 Final: Bottom Fiber Tensile Stress / fctm
 Value > 0
 Final: Extreme Fiber Compressive Stress / fck
 Value > 0
 Sustained: Extreme Fiber Compressive Stress / fck
 Value > 0
 Sustained: Fraction of Live Load Considered
 Value > 0
 Longitudinal Rebar Size Top
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Longitudinal Rebar Size Bottom
 Value is the index in the list of the rebar defined in the Reinforcing Bar Sizes form
 Is Longitudinal Rebar Ribbed
0 = No
Any other value = Yes
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("Italian NTC 2008")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'set preference item
   ret = SapModel.DesignConcrete.ItalianNTC2008C.SetPreference(2, 7)
'get preference item
   ret = SapModel.DesignConcrete.ItalianNTC2008C.GetPreference(2, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCoItalianNTC2008C Interface
ETABSv1 Namespace